faq_data = [
    {
        "pattern": r"(кто\s*может.*(участвовать|участие|принять))|(кто.*(участвовать|участие|принять))|(может.*(участвовать|участие|принять))",
        "response": "Школьники, студенты бакалавриата, специалитета, магистратуры и аспирантуры всех вузов России, а также научные руководители и преподаватели, которые хотят использовать кейсы VK в обучении студентов."
    },
    {
        "pattern": r"(можно|сколько).*?(несколько|много|неограниченно).*?(задач|проектов)",
        "response": "Можно решать неограниченное количество задач."
    },
    {
        "pattern": r"(как|где).*(получить|достать|скачать|найти).*(материал(ы)?|примеры).*",
        "response": "Выбери задачу, пройди регистрацию — и тебе откроется доступ к материалам, которые понадобятся в процессе работы над задачей."
    },
    {
        "pattern": r"(я.*получ(у|ить)|будет.*сертификат)",
        "response": "Если ты выполнишь все условия, описанные в выбранной задаче, то сможешь получить сертификат о работе над проектом VK."
    },
    {
        "pattern": r"(хочу|кому|как).*задать.*вопрос",
        "response": "Следи за расписанием вебинаров на странице проекта — ты сможешь задать вопросы по задаче экспертам VK.  Если у тебя есть организационные вопросы, задай их на обучающей платформе."
    }
]